oha-log-go.log
Summary
  Success rate: 100.00%
  Total:        22.7559 secs
  Slowest:      0.1044 secs
  Fastest:      0.0009 secs
  Average:      0.0114 secs
  Requests/sec: 4394.4652

  Total data:   137.90 MiB
  Size/request: 1.41 KiB
  Size/sec:     6.06 MiB

Response time histogram:
  0.001 [1]     |
  0.011 [52607] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [46286] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [939]   |
  0.042 [134]   |
  0.053 [21]    |
  0.063 [1]     |
  0.073 [4]     |
  0.084 [2]     |
  0.094 [3]     |
  0.104 [2]     |

Response time distribution:
  10.00% in 0.0073 secs
  25.00% in 0.0090 secs
  50.00% in 0.0111 secs
  75.00% in 0.0133 secs
  90.00% in 0.0155 secs
  95.00% in 0.0169 secs
  99.00% in 0.0222 secs
  99.90% in 0.0343 secs
  99.99% in 0.0647 secs


Details (average, fastest, slowest):
  DNS+dialup:   0.0060 secs, 0.0014 secs, 0.0128 secs
  DNS-lookup:   0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200] 100000 responses