oha-log-python.log
Summary:
  Success rate: 98.28%
  Total:        1238.5834 secs
  Slowest:      6.7105 secs
  Fastest:      0.0121 secs
  Average:      0.5993 secs
  Requests/sec: 80.7374

  Total data:   64.76 MiB
  Size/request: 691 B
  Size/sec:     53.54 KiB

Response time histogram:
  0.012 [1]     |
  0.682 [67717] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.352 [18819] |■■■■■■■■
  2.022 [7165]  |■■■
  2.691 [3491]  |■
  3.361 [823]   |
  4.031 [209]   |
  4.701 [36]    |
  5.371 [10]    |
  6.041 [4]     |
  6.710 [1]     |

Response time distribution:
  10.00% in 0.0551 secs
  25.00% in 0.0742 secs
  50.00% in 0.5639 secs
  75.00% in 1.0596 secs
  90.00% in 1.6047 secs
  95.00% in 1.8818 secs
  99.00% in 2.7963 secs
  99.90% in 3.8775 secs
  99.99% in 4.8455 secs


Details (average, fastest, slowest):
  DNS+dialup:   0.2725 secs, 0.0003 secs, 2.8491 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.2342 secs

Status code distribution:
  [200] 98276 responses

Error distribution:
  [1117] No connection could be made because the target machine actively refused it. (os error 10061)
  [604] Only one usage of each socket address (protocol/network address/port) is normally permitted. (os error 10048)
  [3] error writing a body to connection